#coding=UTF-8
'''
Created on 2012-10-8

@author: s00228753
'''


#===============================================================================
# S3中的存储空间，模拟存储空间的逻辑结构
#===============================================================================
class Bucket(object):
    
    #===========================================================================
    # 初始化
    # @name 存储空间名
    # @create_date 存储空间的创建日期
    #===========================================================================
    def __init__(self, name = None, create_date = None):
        self.name = name
        self.create_date = create_date
        
    def __str__(self):
        return self.name


