#coding=UTF-8
'''
Created on 2012-9-29

@author: s00228753
'''

#===============================================================================
# 对象拥有者, 在ListEntry中使用
#===============================================================================
class Owner(object):
    
    #===========================================================================
    # 初始化
    # @param owner_id 拥有者ID
    # @param owner_name 拥有者用户名
    #===========================================================================
    def __init__(self, owner_id = None, owner_name = None):       
        self.owner_id = owner_id
        self.owner_name = owner_name
        
        